import json
import time
import random


def dict_to_json(body):
    return json.dumps(body, separators=(',', ':'))


def get_time_stamp():
    """
    返回12位时间戳 eg:202004211353
    :return:
    """
    local_time = time.localtime(time.time())
    time_stamp = time.strftime("%Y%m%d%H%M", local_time)
    return time_stamp


def get_random_stamp():
    """
    获取6位的数字字符串
    :return:
    """
    s = ""
    for a in range(6):
        s += str(random.randint(0, 9))
    return s


city_name = {'AQG': '安庆', 'AVA': '安顺', 'AOG': '鞍山', 'AKA': '安康', 'AKU': '阿克苏', 'AAT': '阿勒泰', 'YIE': '阿尔山',
             'AMR': '阿拉善盟', 'AXF': '阿拉善左旗', 'RHT': '阿拉善右旗', 'AHJ': '红原', 'NGQ': '阿里', 'AHT': '阿图什', 'AYN': '安阳',
             'AJB': '安吉', 'AEC': '阿拉尔', 'MFM': '澳门', 'BFU': '蚌埠', 'PEK': '北京', 'AEB': '百色', 'BHY': '北海', 'BAV': '包头',
             'BDL': '巴音郭楞', 'BSD': '保山', 'NBS': '白山', 'ETL': '博尔塔拉', 'RLK': '巴彦淖尔', 'DBC': '白城', 'BPL': '博乐',
             'BFJ': '毕节', 'BYE': '白银', 'BZX': '巴中', 'BJC': '宝鸡', 'BAD': '保定', 'BZJ': '亳州', 'BBU': '滨州', 'BXC': '本溪',
             'BSZ': '白沙', 'BIC': '保亭', 'BIF': '北安', 'BPO': '北票', 'CGD': '常德', 'CSX': '长沙', 'CGQ': '长春', 'CZX': '常州',
             'CHG': '朝阳', 'CIF': '赤峰', 'CIH': '长治', 'CTU': '成都', 'BPX': '昌都', 'CXD': '楚雄', 'CKG': '重庆', 'JUH': '九华山',
             'CDE': '承德', 'CNI': '长海', 'CWJ': '沧源', 'CJE': '昌吉', 'CZD': '郴州', 'CIA': '从化', 'SWA': '汕头', 'CZI': '沧州',
             'CHD': '巢湖', 'CZZ': '滁州', 'CSJ': '常熟', 'CXE': '慈溪', 'CZV': '崇左', 'CMN': '澄迈', 'CLW': '昌黎', 'CJX': '昌江',
             'CJQ': '昌江黎族自治县', 'DQA': '大庆', 'DXL': '大兴安岭', 'DLC': '大连', 'DDG': '丹东', 'DOY': '东营', 'DAT': '大同',
             'DAX': '达州', 'DYB': '德阳', 'DLU': '大理', 'LUM': '芒市', 'DIG': '迪庆', 'DNH': '敦煌', 'HXD': '德令哈', 'DCY': '稻城',
             'DOJ': '都江堰', 'DXQ': '儋州', 'DGQ': '东莞', 'DZB': '德州', 'DYC': '丹阳', 'HEW': '东阳', 'DXN': '定西', 'DZX': '大足',
             'DFX': '东方', 'DAE': '定安', 'DYX': '大庸', 'DEQ': '德清', 'DHU': '敦化', 'DGB': '东港', 'DYV': '都匀', 'DHE': '德惠',
             'DF1': '丹凤', 'DSX': '东沙岛', 'ENH': '恩施', 'DSN': '鄂尔多斯', 'ERL': '二连浩特', 'EJN': '额济纳旗', 'EMQ': '峨眉山',
             'ENP': '恩平', 'EZH': '鄂州', 'FUG': '阜阳', 'FOC': '福州', 'FUO': '佛山', 'FYN': '富蕴', 'FYJ': '抚远', 'FCG': '防城港',
             'FEH': '奉化', 'FUX': '阜新', 'FUS': '抚顺', 'FHX': '凤凰', 'FUZ': '抚州', 'FUD': '福鼎', 'FQU': '福泉', 'FCE': '凤城',
             'CAN': '广州', 'KWL': '桂林', 'KWE': '贵阳', 'KOW': '赣州', 'GZG': '甘孜', 'GYS': '广元', 'GYU': '固原',
             'GNW': '甘南藏族自治州', 'GGA': '贵港', 'GMQ': '果洛', 'GNX': '广安', 'GOQ': '格尔木', 'GBI': '高碑店', 'GHG': '根河',
             'KHH': '高雄', 'HFE': '合肥', 'TXN': '黄山', 'HUZ': '惠州', 'HAK': '海口', 'HDG': '邯郸', 'HRB': '哈尔滨', 'HEK': '黑河',
             'HNY': '衡阳', 'HJJ': '芷江', 'HDL': '葫芦岛', 'HET': '呼和浩特', 'HLD': '呼伦贝尔', 'HZG': '汉中', 'HMI': '哈密',
             'HTN': '和田', 'HGH': '杭州', 'HIA': '淮安', 'HZO': '湖州', 'HCJ': '河池', 'HXA': '海西蒙古族藏族自治州', 'HUO': '霍林郭勒',
             'HTT': '花土沟', 'HYN': '台州', 'HBI': '鹤壁', 'HEY': '河源', 'HGS': '黄石', 'HZE': '菏泽', 'HSU': '衡水', 'HBE': '淮北',
             'HNE': '淮南', 'HNJ': '海宁', 'HIC': '海城', 'HEG': '鹤岗', 'HCS': '珲春', 'HHS': '红河', 'FCS': '防城', 'HGB': '黄冈',
             'HYX': '海盐', 'HDO': '海东', 'HND': '黄南', 'HNZ': '海南藏族自治州', 'HZS': '贺州', 'HUA': '侯马', 'HUP': '化州',
             'HYM': '华阴', 'HXI': '华蓥', 'HYH': '海阳', 'HUN': '花莲', 'HCN': '恒春', 'JGN': '嘉峪关', 'CHW': '酒泉', 'JXA': '鸡西',
             'JMU': '佳木斯', 'JIL': '吉林', 'KNC': '吉安', 'JDZ': '景德镇', 'JIU': '九江', 'JNZ': '锦州', 'TNA': '济南', 'JNG': '济宁',
             'JNH': '金华', 'JIC': '金昌', 'JXS': '嘉兴', 'JYI': '江阴', 'SHS': '荆州', 'JGS': '井冈山', 'JGD': '加格达奇', 'JSJ': '建三江',
             'JHG': '西双版纳', 'JSN': '吉首', 'JMN': '荆门', 'JYA': '济源', 'JCS': '晋城', 'JMA': '江门', 'JZU': '焦作', 'JJN': '泉州',
             'JID': '建德', 'JDU': '江都', 'JIZ': '胶州', 'JZH': '九寨沟', 'JYX': '缙云', 'JSX': '嘉善', 'JZO': '晋中', 'JMP': '即墨',
             'JAY': '简阳', 'JHE': '蛟河', 'KNH': '金门', 'CYI': '嘉义', 'KHG': '喀什', 'KRY': '克拉玛依', 'KMG': '昆明', 'KVN': '昆山',
             'KRL': '库尔勒', 'KCA': '库车', 'KJH': '凯里', 'KTP': '奎屯', 'KPD': '开平', 'KFC': '开封', 'KJI': '喀纳斯', 'KGT': '康定',
             'KAH': '开原', 'KZL': '克孜勒苏柯尔克孜自治州', 'LCX': '龙岩', 'LHW': '兰州', 'LZH': '柳州', 'LYA': '洛阳', 'LYG': '连云港',
             'LYI': '临沂', 'LZO': '泸州', 'LXA': '拉萨', 'LZY': '林芝', 'LJG': '丽江', 'LNJ': '临沧', 'LFQ': '临汾', 'LHC': '丽水',
             'LLB': '荔波', 'LPF': '六盘水', 'JMJ': '澜沧', 'LLV': '吕梁', 'LXB': '临夏', 'LSF': '乐山', 'LZB': '阆中', 'LDC': '娄底',
             'LHD': '漯河', 'LCK': '聊城', 'LAG': '六安', 'LWP': '莱芜', 'LXX': '兰溪', 'LYN': '溧阳', 'LXZ': '莱西', 'LHB': '临海',
             'LYD': '辽阳', 'LYY': '辽源', 'LPZ': '梁平', 'HZH': '黎平', 'LDT': '乐东', 'LBG': '来宾', 'LGV': '临高', 'LSD': '陵水',
             'LSG': '庐山', 'LFA': '廊坊', 'LCS': '连城', 'LPW': '滦平', 'LIN': '临安', 'LYZ': '龙游', 'LNL': '陇南',
             'LSR': '凉山彝族自治州', 'LYF': '耒阳', 'LFE': '陆丰', 'LCU': '乐昌', 'LNA': '涟源市', 'LJS': '冷水江', 'LIJ': '乐平',
             'LBH': '灵宝', 'LHH': '凌海', 'LOJ': '潞城', 'LFH': '兰坪', 'LZL': '莲洲', 'GNI': '绿岛', 'KYD': '兰屿', 'MXZ': '梅县',
             'MDG': '牡丹江', 'MIG': '绵阳', 'NZH': '满洲里', 'OHE': '漠河', 'MMR': '茂名', 'MAC': '马鞍山', 'MZS': '蒙自', 'MIQ': '绵竹',
             'MSK': '眉山', 'MLH': '穆棱', 'MHJ': '梅河口', 'YUN': '密云', 'MQI': '莫力达瓦达斡尔族自治旗', 'MFK': '马祖', 'MZG': '马公',
             'NNP': '南平', 'NNG': '南宁', 'NNY': '南阳', 'NKG': '南京', 'NTG': '南通', 'KHN': '南昌', 'NAO': '南充', 'NGB': '宁波',
             'NLH': '宁蒗', 'NJB': '内江', 'NHB': '南海', 'NID': '宁德', 'NHY': '宁海', 'NQX': '那曲', 'NJX': '怒江', 'NSD': '南沙',
             'LHJ': '讷河', 'NNC': '宁安', 'NJJ': '嫩江', 'LZN': '南竿', 'PZI': '攀枝花', 'SYM': '普洱', 'PLB': '平凉', 'PDQ': '平顶山',
             'PXB': '萍乡', 'PUO': '濮阳', 'PTE': '莆田', 'PLG': '蓬莱', 'PHH': '平湖', 'PJD': '盘锦', 'PYZ': '平遥', 'PNW': '普宁',
             'PZC': '彭州', 'PIF': '屏东', 'IQN': '庆阳', 'QDN': '黔东南', 'QXN': '黔西南', 'BPE': '秦皇岛', 'NDG': '齐齐哈尔',
             'TAO': '青岛', 'JUZ': '衢州', 'BAR': '琼海', 'QJA': '曲靖', 'IQM': '且末', 'JIQ': '黔江', 'QZO': '钦州', 'QIJ': '潜江',
             'QYN': '清远', 'QUF': '曲阜', 'QIT': '七台河', 'QZX': '琼中', 'QAS': '迁安', 'QID': '启东', 'QXX': '黔西', 'HBQ': '祁连',
             'QIH': '千岛湖', 'QZH': '青州', 'QNB': '黔南布依族苗族自治州', 'XXA': '栖霞', 'CMJ': '七美', 'RIZ': '日照', 'RKZ': '日喀则',
             'RUL': '瑞丽', 'RAD': '瑞安', 'RQA': '若羌', 'SZX': '深圳', 'SYX': '三亚', 'SJW': '石家庄', 'SHE': '沈阳', 'SHA': '上海',
             'SXF': '绍兴', 'SZV': '苏州', 'WDS': '十堰', 'SHF': '石河子', 'SQJ': '三明', 'SQD': '上饶', 'WGN': '邵阳', 'SUS': '宿迁',
             'SXJ': '鄯善', 'QSZ': '莎车', 'HPG': '神农架', 'YSQ': '松原', 'SYQ': '思茅', 'SNX': '遂宁', 'SZQ': '石嘴山', 'SMF': '三门峡',
             'SZC': '朔州', 'SSF': '韶山', 'SZB': '随州', 'HSC': '韶关', 'SWF': '汕尾', 'SKA': '商丘', 'XIO': '宿州', 'SES': '三河',
             'SSB': '石狮', 'SAI': '上虞', 'SPA': '四平', 'SUC': '绥化', 'SYB': '双鸭山', 'SFB': '绥芬河', 'SPX': '松潘', 'SFW': '什邡',
             'SDA': '顺德龙山', 'SMD': '三门', 'SKF': '商洛', 'SND': '山南', 'SZO': '嵊州', 'SSU': '嵊泗', 'SZT': '深州', 'THQ': '天水',
             'TKM': '铜陵', 'TNH': '通化', 'TGO': '通辽', 'TYN': '太原', 'TSN': '天津', 'TLQ': '吐鲁番', 'TCG': '塔城', 'TVS': '唐山',
             'YTY': '扬州', 'TEN': '铜仁', 'TCZ': '腾冲', 'TCM': '铜川', 'TSA': '台山', 'TMV': '天门', 'TAN': '泰安', 'TXA': '桐乡',
             'TAF': '太仓', 'TIS': '铁岭', 'TCV': '屯昌', 'TLC': '桐庐', 'TTY': '天台', 'TZA': '天柱', 'TWC': '图木舒克', 'TZB': '滕州',
             'TPE': '台北', 'TNN': '台南', 'TTT': '台东', 'RMQ': '台中', 'WUZ': '梧州', 'WUH': '武汉', 'WUX': '无锡', 'WUA': '乌海',
             'WEH': '威海', 'WEF': '潍坊', 'URC': '乌鲁木齐', 'WNH': '文山', 'WNZ': '温州', 'WHU': '芜湖', 'UCB': '乌兰察布',
             'WUS': '武夷山', 'HLH': '乌兰浩特', 'WXN': '万州', 'WUW': '武威', 'WZS': '吴忠', 'WEN': '渭南', 'WXI': '武穴', 'WJI': '吴江',
             'WEG': '温岭', 'DTU': '五大连池', 'WNB': '万宁', 'WEC': '文昌', 'WYX': '婺源', 'WYC': '武义', 'XZS': '五指山', 'WJQ': '五家渠',
             'WCB': '五常', 'WOM': '武安', 'WSK': '巫山', 'WOT': '望安', 'XMN': '厦门', 'XNT': '邢台', 'XFN': '襄阳', 'XUZ': '徐州',
             'XIL': '锡林浩特', 'XAM': '兴安盟', 'XNN': '西宁', 'XIY': '咸阳', 'WUT': '忻州', 'ACX': '兴义', 'GXH': '夏河', 'NLT': '新源',
             'XIC': '西昌', 'XIT': '湘潭', 'XIA': '仙桃', 'XCA': '许昌', 'XIX': '新乡', 'XGM': '孝感', 'XAI': '信阳', 'XAN': '咸宁',
             'XYU': '新余', 'XNS': '兴宁', 'XEN': '兴城', 'XXX': '湘西', 'XLA': '兴隆', 'XUC': '宣城', 'XCX': '新昌', 'XSS': '象山',
             'XAX': '兴安', 'XNX': '湘乡', 'HKG': '香港', 'HSZ': '新竹', 'LDS': '伊春', 'YIH': '宜昌', 'LLF': '永州',
             'YAF': '延边朝鲜族自治州', 'YNZ': '盐城', 'INC': '银川', 'YUS': '玉树', 'YNT': '烟台', 'YCU': '运城', 'ENY': '延安',
             'UYN': '榆林', 'YBP': '宜宾', 'YIN': '伊宁', 'YKH': '营口', 'YIW': '义乌', 'YNJ': '延吉', 'YIC': '宜春', 'YXV': '玉溪',
             'YAE': '雅安', 'YLU': '玉林', 'YJJ': '阳江', 'YFD': '云浮', 'YIY': '益阳', 'YYA': '岳阳', 'YQE': '阳泉', 'YIT': '鹰潭',
             'YIZ': '仪征', 'YIX': '宜兴', 'YKB': '永康', 'YHX': '余杭', 'YYS': '余姚', 'YMX': '元谋', 'YSR': '阳朔', 'YMI': '义马',
             'YKP': '牙克石', 'ZHA': '湛江', 'ZUH': '珠海', 'ZYI': '遵义', 'CGO': '郑州', 'DYG': '张家界', 'ZAT': '昭通', 'HSN': '舟山',
             'ZHY': '中卫', 'YZY': '张掖', 'ZUJ': '镇江', 'NZL': '扎兰屯', 'ZQZ': '张家口', 'ZIY': '资阳', 'ZGA': '自贡', 'ZHQ': '肇庆',
             'ZHC': '株洲', 'ZSB': '中山', 'ZCS': '增城', 'ZME': '驻马店', 'ZHK': '周口', 'ZZA': '枣庄', 'ZHZ': '漳州', 'ZIB': '淄博',
             'ZJI': '诸暨', 'ZHJ': '张家港', 'ZJS': '中江', 'ZDO': '肇东', "PVG": "浦东机场"}

CabinTypeName = {
    1: "航司旗舰店",
    2: "同程特惠",
    3: "品质出行",
    4: "公务舱",
}
